kylix-rd/ESP32_Display_Panel/src/ESP_Panel_Board_Conf.h
/*
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#pragma once

// *INDENT-OFF*

#include "ESP_Panel_Base_Conf.h"

#ifndef ESP_PANEL_CONF_IGNORE
#include "esp_idf_version.h"
#include "soc/soc_caps.h"
#include "ESP_PanelBus.h"

#ifndef ESP_PANEL_USE_SUPPORTED_BOARD
    #ifdef CONFIG_ESP_PANEL_USE_SUPPORTED_BOARD
        #define ESP_PANEL_USE_SUPPORTED_BOARD   CONFIG_ESP_PANEL_USE_SUPPORTED_BOARD
    #else
        #define ESP_PANEL_USE_SUPPORTED_BOARD   (0)
    #endif
#endif

#if ESP_PANEL_USE_SUPPORTED_BOARD
    #if defined(ESP_PANEL_BOARD_ESP32_C3_LCDKIT) || CONFIG_ESP_PANEL_BOARD_ESP32_C3_LCDKIT
        #include "board/ESP32_C3_LCDKIT.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_BOX) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_BOX
        #include "board/ESP32_S3_BOX.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_BOX_3) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_BOX_3
        #include "board/esp32_s3_box_3.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_BOX_3_BETA) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_BOX_3_BETA
        #include "board/ESP32_S3_BOX_3_BETA.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_BOX_LITE) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_BOX_LITE
        #include "board/ESP32_S3_BOX_LITE.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_EYE) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_EYE
        #include "board/ESP32_S3_EYE.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_KORVO_2) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_KORVO_2
        #include "board/ESP32_S3_KORVO_2.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_LCD_EV_BOARD) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_LCD_EV_BOARD
        #include "board/ESP32_S3_LCD_EV_BOARD.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_LCD_EV_BOARD_2) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_LCD_EV_BOARD_2
        #include "board/ESP32_S3_LCD_EV_BOARD_2.h"
    #elif defined(ESP_PANEL_BOARD_ESP32_S3_USB_OTG) || CONFIG_ESP_PANEL_BOARD_ESP32_S3_USB_OTG
        #include "board/ESP32_S3_USB_OTG.h"
    #else
        #error "Unkonw board selected, please refer to the README for supported boards."
    #endif
#endif /* ESP_PANEL_USE_SUPPORTED_BOARD */

/*-------------------------------- LCD Related --------------------------------*/
/* Set to 0 if not using LCD */
#ifndef ESP_PANEL_USE_LCD
    #ifdef CONFIG_ESP_PANEL_USE_LCD
        #define ESP_PANEL_USE_LCD   CONFIG_ESP_PANEL_USE_LCD
    #else
        #define ESP_PANEL_USE_LCD   (0)
    #endif
#endif

#if ESP_PANEL_USE_LCD
    /**
     * LCD controller name.
     */
    #ifndef ESP_PANEL_LCD_NAME
        #if defined(ESP_PANEL_LCD_CONTROLLER_ST7262) || CONFIG_ESP_PANEL_LCD_CONTROLLER_ST7262
            #define ESP_PANEL_LCD_NAME  ST7262
        #elif defined(CONFIG_ESP_PANEL_LCD_CONTROLLER_ST7789) || CONFIG_ESP_PANEL_LCD_CONTROLLER_ST7789
            #define ESP_PANEL_LCD_NAME  ST7789
        #elif defined(CONFIG_ESP_PANEL_LCD_CONTROLLER_GC9503) || CONFIG_ESP_PANEL_LCD_CONTROLLER_GC9503
            #define ESP_PANEL_LCD_NAME  GC9503
        #elif defined(CONFIG_ESP_PANEL_LCD_CONTROLLER_GC9A01) || CONFIG_ESP_PANEL_LCD_CONTROLLER_GC9A01
            #define ESP_PANEL_LCD_NAME  GC9A01
        #else
            #error "Unkonw LCD controller selected, please refer to the README for supported controllers."
        #endif
    #endif

    /* LCD resolution in pixels */
    #ifndef ESP_PANEL_LCD_H_RES
        #ifdef CONFIG_ESP_PANEL_LCD_H_RES
            #define ESP_PANEL_LCD_H_RES CONFIG_ESP_PANEL_LCD_H_RES
        #else
            #error "LCD horizontal resolution is not defined."
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_V_RES
        #ifdef CONFIG_ESP_PANEL_LCD_V_RES
            #define ESP_PANEL_LCD_V_RES CONFIG_ESP_PANEL_LCD_V_RES
        #else
            #error "LCD vertical resolution is not defined."
        #endif
    #endif

    /* LCD Bus Settings */
    /**
     * If set to 1, the bus will skip to initialize the corresponding host. Users need to initialize the host in advance.
     * It is useful if other devices use the same host. Please ensure that the host is initialized only once.
     */
    #ifndef ESP_PANEL_LCD_BUS_SKIP_INIT_HOST
        #ifdef CONFIG_ESP_PANEL_LCD_BUS_SKIP_INIT_HOST
            #define ESP_PANEL_LCD_BUS_SKIP_INIT_HOST    CONFIG_ESP_PANEL_LCD_BUS_SKIP_INIT_HOST
        #else
            #define ESP_PANEL_LCD_BUS_SKIP_INIT_HOST    (0)
        #endif
    #endif
    /* LCD bus type. */
    #ifndef ESP_PANEL_LCD_BUS_TYPE
        #ifdef CONFIG_ESP_PANEL_LCD_BUS_TYPE
            #define ESP_PANEL_LCD_BUS_TYPE  CONFIG_ESP_PANEL_LCD_BUS_TYPE
        #else
            #error "LCD bus type is not defined."
        #endif
    #endif
    /* LCD bus parameters. */
    #if ESP_PANEL_LCD_BUS_TYPE == ESP_PANEL_BUS_TYPE_I2C
        #define ESP_PANEL_LCD_BUS_NAME      I2C
        #error "LCD I2C bus is not available and will be implemented in the future."
    #elif ESP_PANEL_LCD_BUS_TYPE == ESP_PANEL_BUS_TYPE_SPI
        #define ESP_PANEL_LCD_BUS_NAME      SPI

        #ifndef ESP_PANEL_LCD_BUS_HOST_ID
            #ifdef CONFIG_ESP_PANEL_LCD_BUS_HOST_ID
                #define ESP_PANEL_LCD_BUS_HOST_ID   CONFIG_ESP_PANEL_LCD_BUS_HOST_ID
            #else
                #error "LCD bus host id is not defined."
            #endif
        #endif
        #include "hal/spi_types.h"
        #define ESP_PANEL_LCD_BUS_HOST      ((spi_host_device_t)ESP_PANEL_LCD_BUS_HOST_ID)

        #ifndef ESP_PANEL_LCD_SPI_IO_CS
            #ifdef CONFIG_ESP_PANEL_LCD_SPI_IO_CS
                #define ESP_PANEL_LCD_SPI_IO_CS     CONFIG_ESP_PANEL_LCD_SPI_IO_CS
            #else
                #error "LCD SPI CS pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_SPI_IO_DC
            #ifdef CONFIG_ESP_PANEL_LCD_SPI_IO_DC
                #define ESP_PANEL_LCD_SPI_IO_DC     CONFIG_ESP_PANEL_LCD_SPI_IO_DC
            #else
                #error "LCD SPI DC pin is not defined."
            #endif
        #endif

        #if !ESP_PANEL_LCD_BUS_SKIP_INIT_HOST
            #ifndef ESP_PANEL_LCD_SPI_MODE
                #ifdef CONFIG_ESP_PANEL_LCD_SPI_MODE
                    #define ESP_PANEL_LCD_SPI_MODE  CONFIG_ESP_PANEL_LCD_SPI_MODE
                #else
                    #error "LCD SPI mode is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_SPI_CLK_HZ
                #ifdef CONFIG_ESP_PANEL_LCD_SPI_CLK_HZ
                    #define ESP_PANEL_LCD_SPI_CLK_HZ    CONFIG_ESP_PANEL_LCD_SPI_CLK_HZ
                #else
                    #error "LCD SPI clock is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_SPI_TRANS_QUEUE_SZ
                #ifdef CONFIG_ESP_PANEL_LCD_SPI_TRANS_QUEUE_SZ
                    #define ESP_PANEL_LCD_SPI_TRANS_QUEUE_SZ    CONFIG_ESP_PANEL_LCD_SPI_TRANS_QUEUE_SZ
                #else
                    #error "LCD SPI transaction queue size is not defined."
                #endif
            #endif

