kylix-rd/ESP32_Display_Panel/src/ESP_Panel_Board_Conf.h
            #ifndef ESP_PANEL_LCD_SPI_CMD_BITS
                #ifdef CONFIG_ESP_PANEL_LCD_SPI_CMD_BITS
                    #define ESP_PANEL_LCD_SPI_CMD_BITS  CONFIG_ESP_PANEL_LCD_SPI_CMD_BITS
                #else
                    #error "LCD SPI command bits is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_SPI_PARAM_BITS
                #ifdef CONFIG_ESP_PANEL_LCD_SPI_PARAM_BITS
                    #define ESP_PANEL_LCD_SPI_PARAM_BITS    CONFIG_ESP_PANEL_LCD_SPI_PARAM_BITS
                #else
                    #error "LCD SPI parameter bits is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_SPI_IO_SCK
                #ifdef CONFIG_ESP_PANEL_LCD_SPI_IO_SCK
                    #define ESP_PANEL_LCD_SPI_IO_SCK    CONFIG_ESP_PANEL_LCD_SPI_IO_SCK
                #else
                    #error "LCD SPI SCK pin is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_SPI_IO_MOSI
                #ifdef CONFIG_ESP_PANEL_LCD_SPI_IO_MOSI
                    #define ESP_PANEL_LCD_SPI_IO_MOSI   CONFIG_ESP_PANEL_LCD_SPI_IO_MOSI
                #else
                    #error "LCD SPI MOSI pin is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_SPI_IO_MISO
                #ifdef CONFIG_ESP_PANEL_LCD_SPI_IO_MISO
                    #define ESP_PANEL_LCD_SPI_IO_MISO   CONFIG_ESP_PANEL_LCD_SPI_IO_MISO
                #else
                    #define ESP_PANEL_LCD_SPI_IO_MISO   (-1)
                #endif
            #endif
        #endif /* ESP_PANEL_LCD_BUS_SKIP_INIT_HOST */
    #elif ESP_PANEL_LCD_BUS_TYPE == ESP_PANEL_BUS_TYPE_I80
        #define ESP_PANEL_LCD_BUS_NAME      I80
        #error "LCD I80 bus is not available and will be implemented in the future."
    #elif ESP_PANEL_LCD_BUS_TYPE == ESP_PANEL_BUS_TYPE_RGB
        #ifndef SOC_LCD_RGB_SUPPORTED
            #error "LCD RGB is only supported for ESP32-S3, please select the correct board."
        #endif

        #if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
            #error "LCD RGB bus here is only supported in arduino-esp32 v3.x.x (ESP-IDF v5.1), please update the SDK."
        #endif

        #define ESP_PANEL_LCD_BUS_NAME      RGB
        #define ESP_PANEL_LCD_BUS_HOST      (-1)

        #ifndef ESP_PANEL_LCD_RGB_CLK_HZ
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_CLK_HZ
                #define ESP_PANEL_LCD_RGB_CLK_HZ    CONFIG_ESP_PANEL_LCD_RGB_CLK_HZ
            #else
                #error "LCD RGB clock is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_HPW
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_HPW
                #define ESP_PANEL_LCD_RGB_HPW   CONFIG_ESP_PANEL_LCD_RGB_HPW
            #else
                #error "LCD RGB HPW is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_HBP
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_HBP
                #define ESP_PANEL_LCD_RGB_HBP   CONFIG_ESP_PANEL_LCD_RGB_HBP
            #else
                #error "LCD RGB HBP is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_HFP
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_HFP
                #define ESP_PANEL_LCD_RGB_HFP   CONFIG_ESP_PANEL_LCD_RGB_HFP
            #else
                #error "LCD RGB HFP is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_VPW
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_VPW
                #define ESP_PANEL_LCD_RGB_VPW   CONFIG_ESP_PANEL_LCD_RGB_VPW
            #else
                #error "LCD RGB VPW is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_VBP
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_VBP
                #define ESP_PANEL_LCD_RGB_VBP   CONFIG_ESP_PANEL_LCD_RGB_VBP
            #else
                #error "LCD RGB VBP is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_VFP
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_VFP
                #define ESP_PANEL_LCD_RGB_VFP   CONFIG_ESP_PANEL_LCD_RGB_VFP
            #else
                #error "LCD RGB VFP is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_PCLK_ACTIVE_NEG
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_PCLK_ACTIVE_NEG
                #define ESP_PANEL_LCD_RGB_PCLK_ACTIVE_NEG   CONFIG_ESP_PANEL_LCD_RGB_PCLK_ACTIVE_NEG
            #else
                #error "LCD RGB PCLK active level is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_DATA_WIDTH
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_DATA_WIDTH
                #define ESP_PANEL_LCD_RGB_DATA_WIDTH    CONFIG_ESP_PANEL_LCD_RGB_DATA_WIDTH
            #else
                #error "LCD RGB data width is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_FRAME_BUF_NUM
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_FRAME_BUF_NUM
                #define ESP_PANEL_LCD_RGB_FRAME_BUF_NUM    CONFIG_ESP_PANEL_LCD_RGB_FRAME_BUF_NUM
            #else
                #define ESP_PANEL_LCD_RGB_FRAME_BUF_NUM    (1)
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_BOUNCE_BUF_SIZE
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_BOUNCE_BUF_SIZE
                #define ESP_PANEL_LCD_RGB_BOUNCE_BUF_SIZE    CONFIG_ESP_PANEL_LCD_RGB_BOUNCE_BUF_SIZE
            #else
                #define ESP_PANEL_LCD_RGB_BOUNCE_BUF_SIZE   (ESP_PANEL_LCD_H_RES * 10)
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_HSYNC
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_HSYNC
                #define ESP_PANEL_LCD_RGB_IO_HSYNC  CONFIG_ESP_PANEL_LCD_RGB_IO_HSYNC
            #else
                #error "LCD RGB HSYNC pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_VSYNC
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_VSYNC
                #define ESP_PANEL_LCD_RGB_IO_VSYNC  CONFIG_ESP_PANEL_LCD_RGB_IO_VSYNC
            #else
                #error "LCD RGB VSYNC pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DE
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DE
                #define ESP_PANEL_LCD_RGB_IO_DE     CONFIG_ESP_PANEL_LCD_RGB_IO_DE
            #else
                #error "LCD RGB DE pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_PCLK
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_PCLK
                #define ESP_PANEL_LCD_RGB_IO_PCLK   CONFIG_ESP_PANEL_LCD_RGB_IO_PCLK
            #else
                #error "LCD RGB PCLK pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DISP
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DISP
                #define ESP_PANEL_LCD_RGB_IO_DISP   CONFIG_ESP_PANEL_LCD_RGB_IO_DISP
            #else
                #define ESP_PANEL_LCD_RGB_IO_DISP   (-1)
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA0
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA0
                #define ESP_PANEL_LCD_RGB_IO_DATA0      CONFIG_ESP_PANEL_LCD_RGB_IO_DATA0
            #else
                #error "LCD RGB DATA0 pin is not defined."
            #endif
        #endif

