kylix-rd/ESP32_Display_Panel/src/ESP_Panel_Board_Conf.h
        #ifndef ESP_PANEL_LCD_RGB_PIXEL_BITS
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_PIXEL_BITS
                #define ESP_PANEL_LCD_RGB_PIXEL_BITS    CONFIG_ESP_PANEL_LCD_RGB_PIXEL_BITS
            #else
                #error "LCD RGB pixel bits is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA1
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA1
                #define ESP_PANEL_LCD_RGB_IO_DATA1  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA1
            #else
                #error "LCD RGB DATA1 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA2
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA2
                #define ESP_PANEL_LCD_RGB_IO_DATA2  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA2
            #else
                #error "LCD RGB DATA2 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA3
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA3
                #define ESP_PANEL_LCD_RGB_IO_DATA3  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA3
            #else
                #error "LCD RGB DATA3 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA4
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA4
                #define ESP_PANEL_LCD_RGB_IO_DATA4  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA4
            #else
                #error "LCD RGB DATA4 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA5
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA5
                #define ESP_PANEL_LCD_RGB_IO_DATA5  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA5
            #else
                #error "LCD RGB DATA5 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA6
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA6
                #define ESP_PANEL_LCD_RGB_IO_DATA6  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA6
            #else
                #error "LCD RGB DATA6 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA7
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA7
                #define ESP_PANEL_LCD_RGB_IO_DATA7  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA7
            #else
                #error "LCD RGB DATA7 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA8
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA8
                #define ESP_PANEL_LCD_RGB_IO_DATA8  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA8
            #elif ESP_PANEL_LCD_RGB_DATA_WIDTH = 8
                #define ESP_PANEL_LCD_RGB_IO_DATA8  (-1)
            #else
                #error "LCD RGB DATA8 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA9
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA9
                #define ESP_PANEL_LCD_RGB_IO_DATA9  CONFIG_ESP_PANEL_LCD_RGB_IO_DATA9
            #elif ESP_PANEL_LCD_RGB_DATA_WIDTH = 8
                #define ESP_PANEL_LCD_RGB_IO_DATA9  (-1)
            #else
                #error "LCD RGB DATA9 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA10
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA10
                #define ESP_PANEL_LCD_RGB_IO_DATA10 CONFIG_ESP_PANEL_LCD_RGB_IO_DATA10
            #elif ESP_PANEL_LCD_RGB_DATA_WIDTH = 8
                #define ESP_PANE_LCD_RGB_IO_DATA10  (-1)
            #else
                #error "LCD RGB DATA10 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA11
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA11
                #define ESP_PANEL_LCD_RGB_IO_DATA11 CONFIG_ESP_PANEL_LCD_RGB_IO_DATA11
            #elif ESP_PANEL_LCD_RGB_DATA_WIDTH = 8
                #define ESP_PANEL_LCD_RGB_IO_DATA11  (-1)
            #else
                #error "LCD RGB DATA11 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA12
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA12
                #define ESP_PANEL_LCD_RGB_IO_DATA12 CONFIG_ESP_PANEL_LCD_RGB_IO_DATA12
            #elif ESP_PANEL_LCD_RGB_DATA_WIDTH = 8
                #define ESP_PANEL_LCD_RGB_IO_DATA12  (-1)
            #else
                #error "LCD RGB DATA12 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA13
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA13
                #define ESP_PANEL_LCD_RGB_IO_DATA13 CONFIG_ESP_PANEL_LCD_RGB_IO_DATA13
            #elif ESP_PANEL_LCD_RGB_DATA_WIDTH = 8
                #define ESP_PANEL_LCD_RGB_IO_DATA13  (-1)
            #else
                #error "LCD RGB DATA13 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA14
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA14
                #define ESP_PANEL_LCD_RGB_IO_DATA14 CONFIG_ESP_PANEL_LCD_RGB_IO_DATA14
            #elif ESP_PANEL_LCD_RGB_DATA_WIDTH = 8
                #define ESP_PANEL_LCD_RGB_IO_DATA14  (-1)
            #else
                #error "LCD RGB DATA14 pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_LCD_RGB_IO_DATA15
            #ifdef CONFIG_ESP_PANEL_LCD_RGB_IO_DATA15
                #define ESP_PANEL_LCD_RGB_IO_DATA15 CONFIG_ESP_PANEL_LCD_RGB_IO_DATA15
            #elif ESP_PANEL_LCD_RGB_DATA_WIDTH = 8
                #define ESP_PANEL_LCD_RGB_IO_DATA15  (-1)
            #else
                #error "LCD RGB DATA15 pin is not defined."
            #endif
        #endif

        #if !ESP_PANEL_LCD_BUS_SKIP_INIT_HOST
            #ifndef ESP_PANEL_LCD_3WIRE_SPI_SCL_ACTIVE_EDGE
                #ifdef ESP_PANEL_LCD_3WIRE_SPI_SCL_ACTIVE_EDGE
                    #define ESP_PANEL_LCD_3WIRE_SPI_SCL_ACTIVE_EDGE   CONFIG_ESP_PANEL_LCD_3WIRE_SPI_SCL_ACTIVE_EDGE
                #else
                    #error "LCD 3-wire SPI SCL active edge is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_3WIRE_SPI_AUTO_DEL_PANEL_IO
                #ifdef ESP_PANEL_LCD_3WIRE_SPI_AUTO_DEL_PANEL_IO
                    #define ESP_PANEL_LCD_3WIRE_SPI_AUTO_DEL_PANEL_IO   CONFIG_ESP_PANEL_LCD_3WIRE_SPI_AUTO_DEL_PANEL_IO
                #else
                    #error "LCD 3-wire SPI auto delete panel io is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_3WIRE_SPI_CS_USE_EXPNADER
                #ifdef CONFIG_ESP_PANEL_LCD_3WIRE_SPI_CS_USE_EXPNADER
                    #define ESP_PANEL_LCD_3WIRE_SPI_CS_USE_EXPNADER  CONFIG_ESP_PANEL_LCD_3WIRE_SPI_CS_USE_EXPNADER
                #else
                    #define ESP_PANEL_LCD_3WIRE_SPI_CS_USE_EXPNADER  (0)
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_3WIRE_SPI_SCL_USE_EXPNADER
                #ifdef CONFIG_ESP_PANEL_LCD_3WIRE_SPI_SCL_USE_EXPNADER
                    #define ESP_PANEL_LCD_3WIRE_SPI_SCL_USE_EXPNADER CONFIG_ESP_PANEL_LCD_3WIRE_SPI_SCL_USE_EXPNADER
                #else
                    #define ESP_PANEL_LCD_3WIRE_SPI_SCL_USE_EXPNADER (0)
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_3WIRE_SPI_SDA_USE_EXPNADER
                #ifdef CONFIG_ESP_PANEL_LCD_3WIRE_SPI_SDA_USE_EXPNADER
                    #define ESP_PANEL_LCD_3WIRE_SPI_SDA_USE_EXPNADER CONFIG_ESP_PANEL_LCD_3WIRE_SPI_SDA_USE_EXPNADER
                #else
                    #define ESP_PANEL_LCD_3WIRE_SPI_SDA_USE_EXPNADER (0)
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_3WIRE_SPI_IO_CS
                #ifdef CONFIG_ESP_PANEL_LCD_3WIRE_SPI_IO_CS
                    #define ESP_PANEL_LCD_3WIRE_SPI_IO_CS CONFIG_ESP_PANEL_LCD_3WIRE_SPI_IO_CS
                #else
                    #error "LCD SPI CS pin is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_3WIRE_SPI_IO_SCL
                #ifdef CONFIG_ESP_PANEL_LCD_3WIRE_SPI_IO_SCL
                    #define ESP_PANEL_LCD_3WIRE_SPI_IO_SCL    CONFIG_ESP_PANEL_LCD_3WIRE_SPI_IO_SCL
                #else
                    #error "LCD SPI SCL pin is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_3WIRE_SPI_IO_SDA
                #ifdef CONFIG_ESP_PANEL_LCD_3WIRE_SPI_IO_SDA
                    #define ESP_PANEL_LCD_3WIRE_SPI_IO_SDA    CONFIG_ESP_PANEL_LCD_3WIRE_SPI_IO_SDA
                #else
                    #error "LCD SPI SDA pin is not defined."
                #endif
            #endif
        #endif /* ESP_PANEL_LCD_BUS_SKIP_INIT_HOST */
    #else
        #error "Unkonw LCD bus type selected, please refer to the README for supported bus types."
    #endif /* ESP_PANEL_LCD_BUS_TYPE */

