kylix-rd/ESP32_Display_Panel/src/ESP_Panel_Board_Conf.h
    // /* ESP_PANEL_LCD_INIT_CMD */
    // #ifndef ESP_PANEL_LCD_INIT_CMD
    //     #define ESP_PANEL_LCD_INIT_CMD          (NULL)
    // #endif

    /* LCD Color Settings */
    /* LCD color depth in bits */
    #ifndef ESP_PANEL_LCD_COLOR_BITS
        #ifdef CONFIG_ESP_PANEL_LCD_COLOR_BITS
            #define ESP_PANEL_LCD_COLOR_BITS    CONFIG_ESP_PANEL_LCD_COLOR_BITS
        #else
            #define ESP_PANEL_LCD_COLOR_BITS    (16)
        #endif
    #endif
   /* LCD Color Space. */
    #ifndef ESP_PANEL_LCD_RGB_ORDER
        #ifdef CONFIG_ESP_PANEL_LCD_RGB_ORDER
            #define ESP_PANEL_LCD_RGB_ORDER   CONFIG_ESP_PANEL_LCD_RGB_ORDER
        #else
            #define ESP_PANEL_LCD_RGB_ORDER     (0)
        #endif
    #endif

    /* LCD Transformation Flags */
    #ifndef ESP_PANEL_LCD_SWAP_XY
        #ifdef CONFIG_ESP_PANEL_LCD_SWAP_XY
            #define ESP_PANEL_LCD_SWAP_XY  CONFIG_ESP_PANEL_LCD_SWAP_XY
        #else
            #define ESP_PANEL_LCD_SWAP_XY  (0)
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_MIRROR_X
        #ifdef CONFIG_ESP_PANEL_LCD_MIRROR_X
            #define ESP_PANEL_LCD_MIRROR_X  CONFIG_ESP_PANEL_LCD_MIRROR_X
        #else
            #define ESP_PANEL_LCD_MIRROR_X  (0)
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_MIRROR_Y
        #ifdef CONFIG_ESP_PANEL_LCD_MIRROR_Y
            #define ESP_PANEL_LCD_MIRROR_Y  CONFIG_ESP_PANEL_LCD_MIRROR_Y
        #else
            #define ESP_PANEL_LCD_MIRROR_Y  (0)
        #endif
    #endif

    /* LCD Other Settings */
    #ifndef ESP_PANEL_LCD_IO_RST
        #ifdef CONFIG_ESP_PANEL_LCD_IO_RST
            #define ESP_PANEL_LCD_IO_RST    CONFIG_ESP_PANEL_LCD_IO_RST
        #else
            #define ESP_PANEL_LCD_IO_RST    (-1)
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_RST_LEVEL
        #ifdef CONFIG_ESP_PANEL_LCD_RST_LEVEL
            #define ESP_PANEL_LCD_RST_LEVEL CONFIG_ESP_PANEL_LCD_RST_LEVEL
        #else
            #define ESP_PANEL_LCD_RST_LEVEL (0)
        #endif
    #endif
#endif /* ESP_PANEL_USE_LCD */

/*-------------------------------- LCD Touch Related --------------------------------*/
/* Set to 0 if not using LCD touch */
#ifndef ESP_PANEL_USE_LCD_TOUCH
    #ifdef CONFIG_ESP_PANEL_USE_LCD_TOUCH
        #define ESP_PANEL_USE_LCD_TOUCH    CONFIG_ESP_PANEL_USE_LCD_TOUCH
    #else
        #define ESP_PANEL_USE_LCD_TOUCH    (0)
    #endif
#endif

#if ESP_PANEL_USE_LCD_TOUCH
    /* LCD touch IC name. */
    #ifndef ESP_PANEL_LCD_TOUCH_NAME
        #if defined(ESP_PANEL_LCD_TOUCH_CONTROLLER_CST816S) || CONFIG_ESP_PANEL_LCD_TOUCH_CONTROLLER_CST816S
            #define ESP_PANEL_LCD_TOUCH_NAME  CST816S
        #elif defined(ESP_PANEL_LCD_TOUCH_CONTROLLER_FT5X06) || CONFIG_ESP_PANEL_LCD_TOUCH_CONTROLLER_FT5X06
            #define ESP_PANEL_LCD_TOUCH_NAME  FT5x06
        #elif defined(ESP_PANEL_LCD_TOUCH_CONTROLLER_GT1151) || CONFIG_ESP_PANEL_LCD_TOUCH_CONTROLLER_GT1151
            #define ESP_PANEL_LCD_TOUCH_NAME  GT1151
        #elif defined(ESP_PANEL_LCD_TOUCH_CONTROLLER_GT911) || CONFIG_ESP_PANEL_LCD_TOUCH_CONTROLLER_GT911
            #define ESP_PANEL_LCD_TOUCH_NAME  GT911
        #elif defined(ESP_PANEL_LCD_TOUCH_CONTROLLER_TT21100) || CONFIG_ESP_PANEL_LCD_TOUCH_CONTROLLER_TT21100
            #define ESP_PANEL_LCD_TOUCH_NAME  TT21100
        #elif defined(ESP_PANEL_LCD_TOUCH_CONTROLLER_STMPE610) || CONFIG_ESP_PANEL_LCD_TOUCH_CONTROLLER_STMPE610
            #define ESP_PANEL_LCD_TOUCH_NAME  STMPE610
        #else
            #error "Unkonw LCD Touch controller selected, please refer to the README for supported controllers."
        #endif
    #endif

    /* LCD touch resolution in pixels */
    #ifndef ESP_PANEL_LCD_TOUCH_H_RES
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_H_RES
            #define ESP_PANEL_LCD_TOUCH_H_RES CONFIG_ESP_PANEL_LCD_TOUCH_H_RES
        #elif defined(ESP_PANEL_LCD_H_RES)
            #define ESP_PANEL_LCD_TOUCH_H_RES ESP_PANEL_LCD_H_RES
        #elif defined(CONFIG_ESP_PANEL_LCD_H_RES)
            #define ESP_PANEL_LCD_TOUCH_H_RES CONFIG_ESP_PANEL_LCD_H_RES
        #else
            #error "LCD touch horizontal resolution is not defined."
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_TOUCH_V_RES
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_V_RES
            #define ESP_PANEL_LCD_TOUCH_V_RES CONFIG_ESP_PANEL_LCD_TOUCH_V_RES
        #elif defined(ESP_PANEL_LCD_V_RES)
            #define ESP_PANEL_LCD_TOUCH_V_RES ESP_PANEL_LCD_V_RES
        #elif defined(CONFIG_ESP_PANEL_LCD_V_RES)
            #define ESP_PANEL_LCD_TOUCH_V_RES CONFIG_ESP_PANEL_LCD_V_RES
        #else
            #error "LCD touch vertical resolution is not defined."
        #endif
    #endif

    /* LCD Touch Bus Settings */
    /**
     * If set to 1, the bus will skip to initialize the corresponding host. Users need to initialize the host in advance.
     * It is useful if other devices use the same host. Please ensure that the host is initialized only once.
     */
    #ifndef ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST
            #define ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST    CONFIG_ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST
        #else
            #define ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST    (0)
        #endif
    #endif
    /* LCD bus type. */
    #ifndef ESP_PANEL_LCD_TOUCH_BUS_TYPE
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_BUS_TYPE
            #define ESP_PANEL_LCD_TOUCH_BUS_TYPE  CONFIG_ESP_PANEL_LCD_TOUCH_BUS_TYPE
        #else
            #error "LCD bus type is not defined."
        #endif
    #endif
    /* LCD bus parameters. */
    #if ESP_PANEL_LCD_TOUCH_BUS_TYPE == ESP_PANEL_BUS_TYPE_I2C
        #define ESP_PANEL_LCD_TOUCH_BUS_NAME    I2C

        #ifndef ESP_PANEL_LCD_TOUCH_BUS_HOST_ID
            #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_BUS_HOST_ID
                #define ESP_PANEL_LCD_TOUCH_BUS_HOST_ID    CONFIG_ESP_PANEL_LCD_TOUCH_BUS_HOST_ID
            #else
                #define ESP_PANEL_LCD_TOUCH_BUS_HOST_ID    (0)
            #endif
        #endif
        #include "hal/i2c_types.h"
        #define ESP_PANEL_LCD_TOUCH_BUS_HOST      ((i2c_port_t)ESP_PANEL_LCD_TOUCH_BUS_HOST_ID)

        #if !ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST
            #ifndef ESP_PANEL_LCD_TOUCH_I2C_CLK_HZ
                #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_I2C_CLK_HZ
                    #define ESP_PANEL_LCD_TOUCH_I2C_CLK_HZ  CONFIG_ESP_PANEL_LCD_TOUCH_I2C_CLK_HZ
                #else
                    #define ESP_PANEL_LCD_TOUCH_I2C_CLK_HZ  (400 * 1000)
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_TOUCH_I2C_SCL_PULLUP
                #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_I2C_SCL_PULLUP
                    #define ESP_PANEL_LCD_TOUCH_I2C_SCL_PULLUP  CONFIG_ESP_PANEL_LCD_TOUCH_I2C_SCL_PULLUP
                #else
                    #define ESP_PANEL_LCD_TOUCH_I2C_SCL_PULLUP  (0)
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_TOUCH_I2C_SDA_PULLUP
                #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_I2C_SDA_PULLUP
                    #define ESP_PANEL_LCD_TOUCH_I2C_SDA_PULLUP  CONFIG_ESP_PANEL_LCD_TOUCH_I2C_SDA_PULLUP
                #else
                    #define ESP_PANEL_LCD_TOUCH_I2C_SDA_PULLUP  (0)
                #endif
            #endif

