kylix-rd/ESP32_Display_Panel/src/ESP_Panel_Board_Conf.h
            #ifndef ESP_PANEL_LCD_TOUCH_I2C_IO_SCL
                #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_I2C_IO_SCL
                    #define ESP_PANEL_LCD_TOUCH_I2C_IO_SCL  CONFIG_ESP_PANEL_LCD_TOUCH_I2C_IO_SCL
                #else
                    #error "LCD touch I2C SCL pin is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_TOUCH_I2C_IO_SDA
                #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_I2C_IO_SDA
                    #define ESP_PANEL_LCD_TOUCH_I2C_IO_SDA  CONFIG_ESP_PANEL_LCD_TOUCH_I2C_IO_SDA
                #else
                    #error "LCD touch I2C SDA pin is not defined."
                #endif
            #endif
        #endif /* ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST */
    #elif ESP_PANEL_LCD_TOUCH_BUS_TYPE == ESP_PANEL_BUS_TYPE_SPI
        #define ESP_PANEL_LCD_TOUCH_BUS_NAME    SPI

        #ifndef ESP_PANEL_LCD_TOUCH_BUS_HOST_ID
            #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_BUS_HOST_ID
                #define ESP_PANEL_LCD_TOUCH_BUS_HOST_ID    CONFIG_ESP_PANEL_LCD_TOUCH_BUS_HOST_ID
            #else
                #define ESP_PANEL_LCD_TOUCH_BUS_HOST_ID    (1)
            #endif
        #endif
        #define ESP_PANEL_LCD_TOUCH_BUS_HOST      ((spi_host_device_t)ESP_PANEL_LCD_TOUCH_BUS_HOST_ID)

        #ifndef ESP_PANEL_LCD_TOUCH_SPI_IO_CS
            #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_SPI_IO_CS
                #define ESP_PANEL_LCD_TOUCH_SPI_IO_CS CONFIG_ESP_PANEL_LCD_TOUCH_SPI_IO_CS
            #else
                #error "LCD touch SPI CS pin is not defined."
            #endif
        #endif
        #if !ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST
            #ifndef ESP_PANEL_LCD_TOUCH_SPI_IO_SCK
                #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_SPI_IO_SCK
                    #define ESP_PANEL_LCD_TOUCH_SPI_IO_SCK    CONFIG_ESP_PANEL_LCD_TOUCH_SPI_IO_SCK
                #else
                    #error "LCD touch SPI SCK pin is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_TOUCH_SPI_IO_MOSI
                #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_SPI_IO_MOSI
                    #define ESP_PANEL_LCD_TOUCH_SPI_IO_MOSI   CONFIG_ESP_PANEL_LCD_TOUCH_SPI_IO_MOSI
                #else
                    #error "LCD touch SPI MOSI pin is not defined."
                #endif
            #endif

            #ifndef ESP_PANEL_LCD_TOUCH_SPI_IO_MISO
                #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_SPI_IO_MISO
                    #define ESP_PANEL_LCD_TOUCH_SPI_IO_MISO   CONFIG_ESP_PANEL_LCD_TOUCH_SPI_IO_MISO
                #else
                    #error "LCD touch SPI MISO pin is not defined."
                #endif
            #endif
        #endif /* ESP_PANEL_LCD_TOUCH_BUS_SKIP_INIT_HOST */
    #else
        #error "Unkonw LCD touch bus type selected, please refer to the README for supported bus types."
    #endif /* ESP_PANEL_LCD_TOUCH_BUS_TYPE */

    /* LCD Touch Transformation Flags */
    #ifndef ESP_PANEL_LCD_TOUCH_SWAP_XY
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_SWAP_XY
            #define ESP_PANEL_LCD_TOUCH_SWAP_XY    CONFIG_ESP_PANEL_LCD_TOUCH_SWAP_XY
        #else
            #define ESP_PANEL_LCD_TOUCH_SWAP_XY    (0)
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_TOUCH_MIRROR_X
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_MIRROR_X
            #define ESP_PANEL_LCD_TOUCH_MIRROR_X    CONFIG_ESP_PANEL_LCD_TOUCH_MIRROR_X
        #else
            #define ESP_PANEL_LCD_TOUCH_MIRROR_X    (0)
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_TOUCH_MIRROR_Y
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_MIRROR_Y
            #define ESP_PANEL_LCD_TOUCH_MIRROR_Y    CONFIG_ESP_PANEL_LCD_TOUCH_MIRROR_Y
        #else
            #define ESP_PANEL_LCD_TOUCH_MIRROR_Y    (0)
        #endif
    #endif

    /* LCD Touch Other Settings */
    #ifndef ESP_PANEL_LCD_TOUCH_IO_RST
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_IO_RST
            #define ESP_PANEL_LCD_TOUCH_IO_RST  CONFIG_ESP_PANEL_LCD_TOUCH_IO_RST
        #else
            #define ESP_PANEL_LCD_TOUCH_IO_RST  (-1)
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_TOUCH_IO_INT
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_IO_INT
            #define ESP_PANEL_LCD_TOUCH_IO_INT  CONFIG_ESP_PANEL_LCD_TOUCH_IO_INT
        #else
            #define ESP_PANEL_LCD_TOUCH_IO_INT  (-1)
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_TOUCH_RST_LEVEL
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_RST_LEVEL
            #define ESP_PANEL_LCD_TOUCH_RST_LEVEL CONFIG_ESP_PANEL_LCD_TOUCH_RST_LEVEL
        #else
            #define ESP_PANEL_LCD_TOUCH_RST_LEVEL (0)
        #endif
    #endif
    #ifndef ESP_PANEL_LCD_TOUCH_INT_LEVEL
        #ifdef CONFIG_ESP_PANEL_LCD_TOUCH_INT_LEVEL
            #define ESP_PANEL_LCD_TOUCH_INT_LEVEL CONFIG_ESP_PANEL_LCD_TOUCH_INT_LEVEL
        #else
            #define ESP_PANEL_LCD_TOUCH_INT_LEVEL (0)
        #endif
    #endif
#endif /* ESP_PANEL_USE_LCD_TOUCH */

/*-------------------------------- Backlight Related --------------------------------*/
#ifndef ESP_PANEL_USE_BL
    #ifdef CONFIG_ESP_PANEL_USE_BL
        #define ESP_PANEL_USE_BL    CONFIG_ESP_PANEL_USE_BL
    #else
        #define ESP_PANEL_USE_BL    (0)
    #endif
#endif

#if ESP_PANEL_USE_BL
    /* IO num of backlight pin */
    #ifndef ESP_PANEL_LCD_IO_BL
        #ifdef CONFIG_ESP_PANEL_LCD_IO_BL
            #define ESP_PANEL_LCD_IO_BL CONFIG_ESP_PANEL_LCD_IO_BL
        #else
            #error "Backlight pin is not defined."
        #endif
    #endif

    /* If the backlight is on when high level, set to 1; otherwise to 0 */
    #if ESP_PANEL_LCD_IO_BL >= 0
        #ifndef ESP_PANEL_LCD_BL_ON_LEVEL
            #ifdef CONFIG_ESP_PANEL_LCD_BL_LEVEL
                #define ESP_PANEL_LCD_BL_ON_LEVEL  CONFIG_ESP_PANEL_LCD_BL_LEVEL
            #else
                #define ESP_PANEL_LCD_BL_ON_LEVEL  (0)
            #endif
        #endif
    #endif

    /* Set to 1 if use PWM for backlight brightness control. */
    #ifndef ESP_PANEL_LCD_BL_USE_PWM
        #ifdef CONFIG_ESP_PANEL_LCD_BL_USE_PWM
            #define ESP_PANEL_LCD_BL_USE_PWM    CONFIG_ESP_PANEL_LCD_BL_USE_PWM
        #else
            #define ESP_PANEL_LCD_BL_USE_PWM    (0)
        #endif
    #endif

    #if ESP_PANEL_LCD_BL_USE_PWM
        /**
 *  Backlight LEDC Parameters.
 *
 *  Please refer to https://docs.espressif.com/projects/esp-idf/en/latest/esp32s3/api-reference/peripherals/ledc.html for details.
 */
        #ifndef ESP_PANEL_LCD_BL_PWM_TIMER
            #ifdef CONFIG_ESP_PANEL_LCD_BL_PWM_TIMER
                #define ESP_PANEL_LCD_BL_PWM_TIMER  CONFIG_ESP_PANEL_LCD_BL_PWM_TIMER
            #else
                #define ESP_PANEL_LCD_BL_PWM_TIMER  (0)
            #endif
        #endif
        #ifndef ESP_PANEL_LCD_BL_PWM_CHANNEL
            #ifdef CONFIG_ESP_PANEL_LCD_BL_PWM_CHANNEL
                #define ESP_PANEL_LCD_BL_PWM_CHANNEL    CONFIG_ESP_PANEL_LCD_BL_PWM_CHANNEL
            #else
                #define ESP_PANEL_LCD_BL_PWM_CHANNEL    (0)
            #endif
        #endif
        #ifndef ESP_PANEL_LCD_BL_PWM_RESOLUTION
            #ifdef CONFIG_ESP_PANEL_LCD_BL_PWM_RESOLUTION
                #define ESP_PANEL_LCD_BL_PWM_RESOLUTION CONFIG_ESP_PANEL_LCD_BL_PWM_RESOLUTION
            #else
                #define ESP_PANEL_LCD_BL_PWM_RESOLUTION (10)
            #endif
        #endif
        #ifndef ESP_PANEL_LCD_BL_PWM_FREQ_HZ
            #ifdef CONFIG_ESP_PANEL_LCD_BL_PWM_FREQ_HZ
                #define ESP_PANEL_LCD_BL_PWM_FREQ_HZ    CONFIG_ESP_PANEL_LCD_BL_PWM_FREQ_HZ
            #else
                #define ESP_PANEL_LCD_BL_PWM_FREQ_HZ    (5000)
            #endif
        #endif
    #endif /* ESP_PANEL_LCD_BL_USE_PWM */
#endif /* ESP_PANEL_USE_BL */

/*-------------------------------- IO Expander Related --------------------------------*/
/* Set to 0 if not using IO expander */
#ifndef ESP_PANEL_USE_EXPANDER
    #ifdef CONFIG_ESP_PANEL_USE_EXPANDER
        #define ESP_PANEL_USE_EXPANDER    CONFIG_ESP_PANEL_USE_EXPANDER
    #else
        #define ESP_PANEL_USE_EXPANDER    (0)
    #endif
#endif

#if ESP_PANEL_USE_EXPANDER
    /* IO expander IC name. */
    #ifndef ESP_PANEL_EXPANDER_NAME
        #if defined(ESP_PANEL_EXPANDER_CONTROLLER_CST816S) || CONFIG_ESP_PANEL_EXPANDER_CONTROLLER_CST816S
            #define ESP_PANEL_EXPANDER_NAME  CST816S
        #elif defined(ESP_PANEL_EXPANDER_CONTROLLER_FT5X06) || CONFIG_ESP_PANEL_EXPANDER_CONTROLLER_FT5X06
            #define ESP_PANEL_EXPANDER_NAME  FT5x06
        #elif defined(ESP_PANEL_EXPANDER_CONTROLLER_GT1151) || CONFIG_ESP_PANEL_EXPANDER_CONTROLLER_GT1151
            #define ESP_PANEL_EXPANDER_NAME  GT1151
        #else
            #error "Unkonw LCD Touch controller selected, please refer to the README for supported controllers."
        #endif
    #endif

    /* LCD Touch Bus Settings */
    /**
     * If set to 1, the bus will skip to initialize the corresponding host. Users need to initialize the host in advance.
     * It is useful if other devices use the same host. Please ensure that the host is initialized only once.
     */
    #ifndef ESP_PANEL_EXPANDER_SKIP_INIT_HOST
        #ifdef CONFIG_ESP_PANEL_EXPANDER_SKIP_INIT_HOST
            #define ESP_PANEL_EXPANDER_SKIP_INIT_HOST    CONFIG_ESP_PANEL_EXPANDER_SKIP_INIT_HOST
        #else
            #define ESP_PANEL_EXPANDER_SKIP_INIT_HOST    (0)
        #endif
    #endif

    #ifndef ESP_PANEL_EXPANDER_HOST_ID
        #ifdef CONFIG_ESP_PANEL_EXPANDER_HOST_ID
            #define ESP_PANEL_EXPANDER_HOST_ID    CONFIG_ESP_PANEL_EXPANDER_HOST_ID
        #else
            #define ESP_PANEL_EXPANDER_HOST_ID    (0)
        #endif
    #endif

    #include "hal/i2c_types.h"
    #define ESP_PANEL_EXPANDER_HOST      ((i2c_port_t)ESP_PANEL_EXPANDER_HOST_ID)

    #if !ESP_PANEL_EXPANDER_SKIP_INIT_HOST
        #ifndef ESP_PANEL_EXPANDER_I2C_CLK_HZ
            #ifdef CONFIG_ESP_PANEL_EXPANDER_I2C_CLK_HZ
                #define ESP_PANEL_EXPANDER_I2C_CLK_HZ  CONFIG_ESP_PANEL_EXPANDER_I2C_CLK_HZ
            #else
                #define ESP_PANEL_EXPANDER_I2C_CLK_HZ  (400 * 1000)
            #endif
        #endif

        #ifndef ESP_PANEL_EXPANDER_I2C_SCL_PULLUP
            #ifdef CONFIG_ESP_PANEL_EXPANDER_I2C_SCL_PULLUP
                #define ESP_PANEL_EXPANDER_I2C_SCL_PULLUP  CONFIG_ESP_PANEL_EXPANDER_I2C_SCL_PULLUP
            #else
                #define ESP_PANEL_EXPANDER_I2C_SCL_PULLUP  (0)
            #endif
        #endif

        #ifndef ESP_PANEL_EXPANDER_I2C_SDA_PULLUP
            #ifdef CONFIG_ESP_PANEL_EXPANDER_I2C_SDA_PULLUP
                #define ESP_PANEL_EXPANDER_I2C_SDA_PULLUP  CONFIG_ESP_PANEL_EXPANDER_I2C_SDA_PULLUP
            #else
                #define ESP_PANEL_EXPANDER_I2C_SDA_PULLUP  (0)
            #endif
        #endif

        #ifndef ESP_PANEL_EXPANDER_I2C_IO_SCL
            #ifdef CONFIG_ESP_PANEL_EXPANDER_I2C_IO_SCL
                #define ESP_PANEL_EXPANDER_I2C_IO_SCL  CONFIG_ESP_PANEL_EXPANDER_I2C_IO_SCL
            #else
                #error "IO expander I2C SCL pin is not defined."
            #endif
        #endif

        #ifndef ESP_PANEL_EXPANDER_I2C_IO_SDA
            #ifdef CONFIG_ESP_PANEL_EXPANDER_I2C_IO_SDA
                #define ESP_PANEL_EXPANDER_I2C_IO_SDA  CONFIG_ESP_PANEL_EXPANDER_I2C_IO_SDA
            #else
                #error "IO expander I2C SDA pin is not defined."
            #endif
        #endif
    #endif /* ESP_PANEL_EXPANDER_SKIP_INIT_HOST */
#endif /* ESP_PANEL_USE_EXPANDER */
// *INDENT-OFF*

#endif /* ESP_PANEL_BOARD_CONF_IGNORE */
